Revit 2027 API
ParameterTypeId.StructuralStickSymbolLocation Property
 "Stick Symbol Location"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralStickSymbolLocation { get; }
Public Shared ReadOnly Property StructuralStickSymbolLocation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralStickSymbolLocation {
	ForgeTypeId^ get ();
}
static member StructuralStickSymbolLocation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace